# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

s = int (input("C журавликов сделали дети? : "))
print("Катя сделала:" , int (s/6*4))
print("Петя сделал:" , int (s/6*1))
print("Сережа сделал:" , int (s/6*1))